Ran Plan for project: `traffic-tacos` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.awsprometheus.data.aws_prometheus_workspace.aws_prometheus will be read during apply
  # (config refers to values not yet known)
 <= data "aws_prometheus_workspace" "aws_prometheus" {
      + alias               = (known after apply)
      + arn                 = (known after apply)
      + created_date        = (known after apply)
      + id                  = (known after apply)
      + kms_key_arn         = (known after apply)
      + prometheus_endpoint = (known after apply)
      + status              = (known after apply)
      + tags                = (known after apply)
      + workspace_id        = (known after apply)
    }

  # module.awsprometheus.aws_prometheus_workspace.aws_prometheus will be created
+ resource "aws_prometheus_workspace" "aws_prometheus" {
      + alias               = "tacos-prometheus"
      + arn                 = (known after apply)
      + id                  = (known after apply)
      + prometheus_endpoint = (known after apply)
      + tags_all            = {
          + "ManagedBy" = "terraform"
          + "Project"   = "ticket-traffic"
        }
    }

  # module.eks.aws_eks_node_group.ondemand_node_group will be updated in-place
~ resource "aws_eks_node_group" "ondemand_node_group" {
        id                     = "ticket-cluster:ondemand-node-group"
        tags                   = {
            "Name"                                 = "ondemand-node-group"
            "kubernetes.io/cluster/ticket-cluster" = "owned"
        }
        # (16 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0522ada41d6ebb6bf"
            name    = "ondemand_lt"
          ~ version = "1" -> "$Latest"
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.aws_eks_node_group.spot_node_group will be updated in-place
~ resource "aws_eks_node_group" "spot_node_group" {
        id                     = "ticket-cluster:spot-node-group"
        tags                   = {
            "Name"                                 = "spot-node-group"
            "kubernetes.io/cluster/ticket-cluster" = "owned"
        }
        # (16 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0791db289d622ace2"
            name    = "spot_lt-v2"
          ~ version = "1" -> "$Latest"
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.


=== 💰 Infracost 비용 분석 ===
현재 인프라 비용:
Error: Invalid API Key, please check your INFRACOST_API_KEY environment variable or /home/atlantis/.config/infracost/credentials.yml credentials file.
If you recently regenerated your API key, you can retrieve it from https://dashboard.infracost.io.
See https://infracost.io/support if you continue having issues.

변경사항으로 인한 비용 차이:
Error: Invalid API Key, please check your INFRACOST_API_KEY environment variable or /home/atlantis/.config/infracost/credentials.yml credentials file.
If you recently regenerated your API key, you can retrieve it from https://dashboard.infracost.io.
See https://infracost.io/support if you continue having issues.
=== 비용 분석 완료 ===
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p traffic-tacos
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://9ebcf8e225bc:4141/lock?id=traffic-tacos%252Ftraffic-tacos-infra-iac%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p traffic-tacos
  ```
Plan: 1 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```